In [1]:
from sqlalchemy import create_engine
import urllib.parse
from cfg import password
import pandas as pd

In [2]:
engine = create_engine('postgresql://postgres:'+password+'@localhost:5432/Homework09')

In [3]:
connection = engine.connect()

In [4]:
salaries = pd.read_sql('SELECT * FROM salaries', connection)

In [5]:
salaries["salary"].hist(bins=10)

In [6]:
salaryByTitle = pd.read_sql('SELECT t.title, s.salary FROM salaries AS s INNER JOIN titles as t ON t.emp_no = s.emp_no Group By t.title, s.salary', connection)

salaryByTitle

                     title  salary
0       Assistant Engineer   40000
1       Assistant Engineer   40001
2       Assistant Engineer   40004
3       Assistant Engineer   40013
4       Assistant Engineer   40016
...                    ...     ...
155227    Technique Leader   94100
155228    Technique Leader   94322
155229    Technique Leader   95198
155230    Technique Leader   98181
155231    Technique Leader  104065

[155232 rows x 2 columns]

In [7]:
avgSal = salaryByTitle.groupby(['title']).mean()

def format(x):
        return "${:,.2f}".format(x)

avgSal_f = pd.DataFrame(avgSal)
avgSal_f['salary'] = avgSal_f['salary'].apply(format)

avgSal_f

                        salary
title
Assistant Engineer  $54,306.01
Engineer            $57,222.23
Manager             $55,374.72
Senior Engineer     $56,731.44
Senior Staff        $66,215.50
Staff               $66,525.68
Technique Leader    $54,472.72

In [8]:
my_sal = pd.read_sql('SELECT t.title, s.salary FROM salaries AS s INNER JOIN titles as t ON t.emp_no = s.emp_no WHERE s.emp_no=499942', connection)
my_sal_f = pd.DataFrame(my_sal)
my_sal_f['salary'] = my_sal_f['salary'].apply(format)
my_sal_f

              title      salary
0  Technique Leader  $40,000.00